Documents/ИнвентаризацияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ИнвентаризацияТМЦ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Записать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЦеныТоваров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараПродажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараВозвратная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИнвентаризацияТМЦ/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Предопределенные
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаСервере
Процедура ТоварыЗаполнитьНаСервере(Обновление)
	ТаблицаЗначений = Объект.Товары.Выгрузить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОстаткиТовар.Товар КАК Товар,
	|	ОстаткиТовар.КоличествоОстаток КАК Остаток,
	|	ВЫБОР КОГДА ОстаткиТовар.КоличествоОстаток <> 0 ТОГДА (ОстаткиТовар.СуммаОстаток / ОстаткиТовар.КоличествоОстаток) ИНАЧЕ ЦеныТоваров.Цена КОНЕЦ КАК ЦенаБазовая
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&Дата, Склад = &Склад И Порожняя = Ложь И Бронь = Ложь) КАК ОстаткиТовар
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних(&Дата, Тип = ""ЦенаБазовая"") КАК ЦеныТоваров ПО ЦеныТоваров.Товар.Ссылка = ОстаткиТовар.Товар.Ссылка
	|ГДЕ
	|	ОстаткиТовар.КоличествоОстаток <> 0 И (ОстаткиТовар.Товар.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Продукция) ИЛИ ОстаткиТовар.Товар.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Товар))");
	
	Если Обновление Тогда
		Запрос.Текст = Запрос.Текст + " И ОстаткиТовар.Товар В (&МассивТоваров)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиТовар.Товар.Наименование
	|ИТОГИ
	|	СУММА(Остаток),
	|	СУММА(ЦенаБазовая)
	|ПО
	|	Товар";

	Запрос.УстановитьПараметр("Дата", Объект.Дата + 1);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	Если Обновление Тогда
		Запрос.УстановитьПараметр("МассивТоваров", ТаблицаЗначений.ВыгрузитьКолонку("Товар"));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаТовар.Следующий() Цикл
		СтарыеСтроки = ТаблицаЗначений.НайтиСтроки(Новый Структура("Товар", ВыборкаТовар.Товар));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		ИначеЕсли НЕ Обновление Тогда
			ТекСтрока = ТаблицаЗначений.Добавить();
		КонецЕсли;
		
		ТекСтрока.Товар = ВыборкаТовар.Товар;
		ТекСтрока.Остаток = ВыборкаТовар.Остаток;
		ТекСтрока.Разница = ТекСтрока.Остаток - ТекСтрока.Количество;
		ТекСтрока.ЦенаБазовая = ВыборкаТовар.ЦенаБазовая;
	КонецЦикла;
	
	Если (НЕ Обновление) Тогда
		ТаблицаЗначений.Сортировать("Товар");
	КонецЕсли;
	
	Объект.Товары.Загрузить(ТаблицаЗначений);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаполнить(Кнопка)
	Если Объект.Склад.Пустая() Тогда
		Предупреждение("Не выбран склад!");
		Возврат;
	КонецЕсли;
	
	ТоварыЗаполнитьНаСервере(Ложь);
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТоварыОбновитьСтроку(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбновить(Кнопка)
	Если Объект.Склад.Пустая() Тогда
		Предупреждение("Не выбран склад!");
		Возврат;
	КонецЕсли;
	
	ТоварыЗаполнитьНаСервере(Истина);
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТоварыОбновитьСтроку(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУдалитьПС(Кнопка)
	ПустыеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Записать", Ложь)); 
	Для Каждого Строка Из ПустыеСтроки Цикл 
		Объект.Товары.Удалить(Строка); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТоварыОбновитьСтроку(ТекСтрока);
	
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРазницаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Количество = ТекСтрока.Остаток - ТекСтрока.Разница;
	
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Записать = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбновитьСтроку(ТекСтрока)
	ТекСтрока.Остаток = РаботаСТоварами.Остаток(Объект.Склад, ТекСтрока.Товар, Объект.Дата);
	
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПересчитатьСтроку(ТекСтрока)
	ТекСтрока.Разница = ТекСтрока.Остаток - ТекСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()
	Остаток = Объект.Товары.Итог("Остаток");
	Количество = Объект.Товары.Итог("Количество");
	Разница = Объект.Товары.Итог("Разница");
КонецПроцедуры
